/*
 *      | 한개만 존재 => 배열 / 클래스
 *     리턴형  메소드명(매개변수...) => 선언부
 *     {            --------- 데이터 묶음 (매개변수 3개이상)
 *         구현부               | 배열 / 클래스
 *     } 
 *     
 *     메소드를 가지고 있으면 클래스다
 *      => 일반 데이터형 / 클래스형(String)
 *         ----------------------------
 *   요청값      
 *    ===>  매개변수 
 *           -----
 *           처리  ===> 결과값 / 자체처리
 *         -----------          |
 *                             void  
 *                             
 *   --------------------------------------------------
 *   int disp(int a, int b)     -----------------> ex) 먹는다() ->소가? 말이?..
 *   {                                                 달린다() ->소가? 개가? 말이?...   ==> 동물(인터페이스)
 *                                                      ...
 *   } // 블럭 닫으면 메모리에 저장                           
 *   
 *   int a=10
 *   int b=20
 *   int c=30
 *   
 *   LIFO / FIFO (Q)
 *          ---- 채팅, 네트워크 (Hello(o) olleH(x))
 *               운영체제 (먼저 클릭한게 먼저 열린다)
 *   ----        
 *   
 *   메소드 
 *   ---- Call Stack (마지막부터 삭제된다)
 *   void main()
 *   {
 *       aaa()
 *   }
 *    void aaa()
 *    {
 *        bbb()
 *    }
 *    void bbb()
 *    {
 *        ccc()
 *    }
 *    
 *          
 *        
 * 
 */
class A
{
	void aaa()
	{
		
	}
	void bbb()
	{
		
	}
	void ccc()
	{
		
	}
	void ddd()
	{
		
	}
}
public class 메소드_4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
