package 자바기본문법;
/*
 *  주석처리=> 번역이 안되는 부분
 *  1. 대소문자 구분
 *  2. 명령문 => CPU에 명령을 내려서 수행
 *  ----- 문장 종료 => ;
 *      ㅣ 명령 => 순서(알고리즘) => 순서도 
 *  3. 자바파일 저장 => (클래스명과 동일).java
 *     class A => A. java
 *     => 웹이서는 한글로 사용하면 안됨
 *       %EC%9E%90%EB%B0%94 : 자바
 *       https://www.google.com/search?q=%EC%9E%90%EB%B0%94&oq=%EC%9E%90%EB%B0%94&gs_lcrp=EgZjaHJvbWUyBggAEEUYOdIBCTY2MTBqMGoxNagCALACAA&sourceid=chrome&ie=UTF-8      
 *       =>운영체제가 변경이 되면 한글 사용이 불가능
 *       ------------CI/CD => 우분투(리눅스) : AWS
 *  4. 자바 공부
 *     기본 : 교재 (이것이 자바다)
 *     -----------
 *     ***1) 변수 => 데이터형 Chapter02
 *     ***2) 연산자 => Chapter03
 *     ***3) 제어문 => Chapter04
 *         ***조건문 / 반복문
 *        형식, 문법사항 잘 기억
 *     4) 객체지향 프로그램 > Chapter05
 *        ㅣ클래스 / 객체 / 상속 / 캠슐화 / 다형성 =>Chapter05~07
 *     5) 인터페이스 / 내부 클래스  => Chapter08~09
 *     개념파악
 *     6) 라이브러리 : 이미 만들어져 있는 클래스를 사용
 *     7) 예외처리 : 에러방지 => Chapter11
 *     암기 / 사용처
 *     ------------------------------------------------------------필수공부
 *     12장 / 13장 / 15장 / 16~17장 약간 / 18장 / 19장 (흐름만)
 *     ***20장 => 데이터 베이스 연동 (매우중요) => 수료하는 날까지 사용 
 *     ------------------------------------------------------------  
 *     자바는 독립적
 *     오라클 연동 자바
 *     ***웹에서 브라우저로 결과값 전송 => 웹 
 *     오라클은 저장소(영구적)
 *     자바는 램에 저장(끄면 삭제됨)
 *     
 *     => 문법 =>카페에 올림
 *     => 소스 => GIT에 올림
 *     
 *     
 *     
 *     
 *     
 *     
 *     
 *     
 *     
 */
public class 기본문법 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        //System.out.println(Array.toString("자바".getByte())
	}

}
