package 자바기본문법;
/*
 * 
 * 자바에서 데이터 표현법
 * ---------------
 * 자바의 역사
 * ----------
 * 1. 자바는 게임기에 들어가는 프로그램(세븐스타) => 오크
 *    => 주인공 이름 듀크
 *    => 많이 사용하는 프로그램 임베디드 : 모바일 프로그램 (J2ME)
 * 2. 통합리모콘 : 그린프로젝트
 *       ㅣ 파산 (후원사 부재)
 * 3. 네스케이프에서 인수 
 *   ---------브라우저 업체 => 웹(J2EE) 
 *       ㅣ 개발자 => JavaScript 개발
 * 4. 독립 => 1995년 / 5 / 23 => 자바데이 (제임스고슬링: 자바언어 만든이)      
 *                                   ---------------------현존 최고의 프로그래머
 *                                                        ㅣ 이직 => 구글로 이직
 *                                                                ----------
 *                                                                 Go / AngularJS 개발
 *                                                                 ------------------
 *                                                                 ㅣ 부팀장 
 *                                                                 --------
 *                                                                 ㅣ VueJS 개발 (개인이 만들어 부족)
 *  VueJS => vue / vuex / pinia
 *     -------------------------- MVC
 * 5. 공식적으로 자바 탄생 알림
 *    -------------- 제임스 고슬링 / 아서 벤
 *                   --Ja            Va => java
 *             => 애플릿 (웹에서 실행)
 *             => 웹:정보 전달 (문자열) => 이미지, 동영상
 * 6. 한국 도착 : 1996년
 *    ------------인터넷 보급 미흡으로 흥하지 않음
 * 7. 2000년 웹마스터 (상거래 : 전자상거래 => 5000개 이상)
 *    => 자바교육 : 1개월 => 모든 인원 취업이 되는 상태
 *       삼성 : => 1개월 교육비용 360만원 => JSP / Servlet
 * 8. 자바 : 언어 / 운영체제 (솔라리스) / 데이터베이스
 *                                 --------MySQL 인수 =>부도
 * 9. 인수 => 오라클 => 불만 (제인스 고슬링)
 *                    --------나와서 구글 취업
 * 10. 오라클 문제점 => 자바 유료화 : 오픈 소스 사용 (OpenJDK 사용) -무료
 *     -------------------------------------------------------
 *     ㅣ자바대체 언어 : Kotlin 
 *  => 자바
 *    1. 웹개발
 *    2. 모바일 => 안드로이드
 *    ================
 *    J2SE ==> 기본
 *    ================
 *    J2EE ==> 웹 (기업용)
 *    ================
 *    J2ME ==> 모바일 ===> 오라클에서 모바일에 첨부 자바는 유료
 *             => 코틀린으로 대체 /플루터 (Dart)       
 *    ================
 *     
 *     => 핸드폰
 *        안드로이드 운영체제
 *        --------=> 첫 거래 삼성 실패 => 구글이 거래 함
 *        ㅣ=> 삼성이 바다라는 운영체제 개발 => 우리나라 흥행 실패 / 동남아에서나 사용
 *        ㅣ=> 티맥스 => 운영체제 개발했으나 망함 => 회사 사라짐
 *        ㅣ=> 티맥스 개발자 삼성에서 데려감 
 *        -----------------------------------------------------------
 *        삼성 VS 애플 싸움남 
 *         중간에 ms 끼어듬 => 제안 : 핸드폰 1개당 20달러
 *                              ---------삼성 계약 => 너무 많이 팔려서 망함
 *         --
 *         
 *       우리나라 개발 => AI / 임베디드 등
 *       
 *     => 자바의 단점
 *       exe File 불가 => .Class => 그냥 실행가능 (브라우저)
 *       -------jar File 만들면 바로 실행 가능
 *       => 윈도우 : swing / JavaFX 
 *                        -------- 브라우저 실행 
 *       =>CBD (이미 기능이 만들어져 있다)
 *         자바 => 조립식 => 객체지향 프로그램
 *                ㅣ 도구 => 컴포넌트 => class : 재사용 / 수정가능 / 추가가능
 *                c / c++
 *                    ----한개증가
 *                    c With class
 *                                                                                                                       
 *                                
 */
public class 자바기초 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
