/*
 *      메소드 : 동작 / 행위를 구현
 *             --------- 기능 처리
 *             장점
 *              1. 소스 간결 : 반복 제거
 *                  - 관련된 내용만 모아서 저장
 *                  - 디버깅 / 추가 / 수정
 *              2. 가독성 : 단락
 *              3. 형식, 동작 순서, 호출방식
 *              -----------------------
 *             형식)
 *              1. 메소드명 : 의미부여
 *                          => 7~15자리 사이에서 만들어 진다
 *                          => 식별자, 소문자로 시작
 *              2. 리턴형  : 사용자가 요청한 데이터에 대해 처리한 결과값
 *                          => 반드시 한개만 설정
 *                          => 데이터가 많은 경우 배열 / 클래스
 *              3. 매개변수 : 사용자의 요청값 
 *              
 *               리턴형 메소드명(매개변수...)
 *               ----
 *               {
 *                   매개변수를 이용해서 결과값 추출
 *                   return 값;
 *                          -- => 리턴형과 값의 데이터 형이 동일 해야 한다
 *               }    
 *               
 *               => 호출 
 *                   - 메소드명(매개변수값)
 *                            ----- 메소드 종료와 동시에 소멸
 *                     void aaa(int a)
 *                      => aaa(10)
 */
public class 메소드_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
